blog/2021/lc-26-remove-duplicates-from-sorted-array.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 17:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>LC26. 删除有序数组中的重复项</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">LC26. 删除有序数组中的重复项</h1>
</header><p>
今天思考 LeetCode 题目：删除有序数组中的重复项<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
</p>

<div id="outline-container-orgf877c02" class="outline-2">
<h2 id="orgf877c02">题目描述</h2>
<div class="outline-text-2" id="text-orgf877c02">
<p>
给定一个有序数组 <code>nums</code> ， <b>原地</b> 删除重复出现的元素，使每个元素 <b>只出现一次</b> ，返回删除后数组的新长度。
</p>

<p>
不要使用额外的数组空间，必须 <b>原地修改输入数组</b> 并在使用 \(O(1)\) 额外空间的条件下完成。
</p>

<p>
提示：
</p>

<ul class="org-ul">
<li><code>0 &lt;= nums.length &lt;= 3 * 10^4</code></li>
<li>\(-10^4 <= nums[i] <= 10^4\)</li>
<li><code>nums</code> 已按升序排列</li>
</ul>
</div>
</div>

<div id="outline-container-org70c5fdd" class="outline-2">
<h2 id="org70c5fdd">题解<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-org70c5fdd">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #7c7565;">/**</span>
<span style="color: #7c7565;"> * @param {number[]} nums</span>
<span style="color: #7c7565;"> * @return {number}</span>
<span style="color: #7c7565;"> */</span>
<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">removeDuplicates</span> = <span style="color: #91a0b3;">function</span>(<span style="color: #aaca86;">nums</span>) {
    <span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">n</span> = nums.length;
    <span style="color: #91a0b3;">if</span> (n === 0) {
        <span style="color: #91a0b3;">return</span> 0;
    }
    <span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">fast</span> = 1, <span style="color: #aaca86;">slow</span> = 1;
    <span style="color: #91a0b3;">while</span> (fast &lt; n) {
        <span style="color: #91a0b3;">if</span> (nums[fast] !== nums[fast - 1]) {
            nums[slow] = nums[fast];
            ++slow;
        }
        ++fast;
    }
    <span style="color: #91a0b3;">return</span> slow;
}
</pre>
</div>

<p>
如果数组为空，则返回 0；之后采用双指针法，定义快慢两个指针，在数组长度范围内，将 fast 和 fast-1 比较，如果相等，继续比较；不相等则将 fast 位置的数组值赋给 slow 的对应数组值，slow+1。当 fast 超过数组长度时，跳出循环，返回 slow。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/remove-duplicates-from-sorted-array/">https://leetcode-cn.com/problems/remove-duplicates-from-sorted-array/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/remove-duplicates-from-sorted-array/solution/shan-chu-pai-xu-shu-zu-zhong-de-zhong-fu-tudo/">https://leetcode-cn.com/problems/remove-duplicates-from-sorted-array/solution/shan-chu-pai-xu-shu-zu-zhong-de-zhong-fu-tudo/</a></p></div></div>


</div>
</div></div>
</body>
</html>